КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ДвижениеДокументооборота/КонтурЛогистика_ДвижениеДокументооборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ДвижениеДокументооборота</name>
  <comment>время периода по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <comment>kl-status из сервиса: Титул.CustomData</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлОбмена</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ФайлыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналТранспорта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_КаналыТранспорта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул1/КонтурЛогистика_ПЭ_Титул1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЭ_Титул1</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭксп</name>
    <comment>Уникальный идентификатор документа (УИД) электронного поручения экпедитору, Выдается государственной информационной системой электронных перевозочных документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭкспОтз</name>
    <comment>УИД отозванного электронного поручения экспедитору, вместо которого сформировано данное электронное поручение экспедитору</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДок</name>
    <comment>Дата выдачи поручения экспедитору</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвКлиент</name>
    <comment>Сведения о клиенте - заказчике экспедиции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СвЭксп</name>
    <comment>Сведения об экспедиторе</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДогТрЭксп</name>
    <comment>Реквизиты договора транспортной экспедиции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимЭкСубСост</name>
    <comment>Наименование экономического субъекта, составляющего файл обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1с</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквНаимДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквНомерДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДатаДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительШаблона</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийРедактированияШаблона</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииРедактированияШаблона</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВходящийШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументШаблон</name>
    <comment>Ссылка на документ шаблон, по которому было создано поручение</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>DefinedType.КонтурЛогистика_РазделительДокументаУчетнойСистемы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвГруз</name>
    <attributes>
      <name>ПЭ_СвГруз</name>
      <type>
        <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Предназначено для обмена информацией не предусмотренной форматом</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИныеДанныеКлт</name>
    <attributes>
      <name>ДанныеИОговорки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопрДок</name>
    <attributes>
      <name>РеквНаимДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквНомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвПредЗак</name>
    <comment>Указывается в случае, если клиент в свою очередь выступает организатором выполнения услуг, связанных с организацией перевозки груза, определенных договором транспортной экспедиции, заключенным с предшествующим заказчиком услуг</comment>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснованияМаршрутов</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияДЛСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НайтиСуществующийМаршрут(ДЛ_ЗаявкаНаДоставку) Экспорт
	
	// TODO проработать проблему если найдем несколько
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.НомДок = &НомДок
	|	И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.СвЭксп = &СвЭксп
	|	И НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомДок", ДЛ_ЗаявкаНаДоставку.НомерЗаказа);
	Запрос.УстановитьПараметр("СвЭксп", КонтурЛогистика_ИнтеграцияДЛСервер.ДЛ_ОрганизацияЭкспедитор());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДокументыОснования(ДЛ_ЗаявкаНаДоставку) Экспорт

	Возврат ДЛ_ЗаявкаНаДоставку.ДокументыОснования.Выгрузить(,"Документ").ВыгрузитьКолонку("Документ");	

КонецФункции

Функция СоздатьМаршрут(ДЛ_ЗаявкаНаДоставку) Экспорт

	ДанныеЗаполнения = Новый Структура("ДЛ_ЗаявкаНаДоставку", ДЛ_ЗаявкаНаДоставку);
	
	ОбъектМаршрут = Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.СоздатьДокумент();
	ОбъектМаршрут.Заполнить(ДанныеЗаполнения);  // TODO передать параметр заполнения
	Если Не ЗначениеЗаполнено(ОбъектМаршрут.Дата) Тогда
		ОбъектМаршрут.Дата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	ОбъектМаршрут.Записать();
	
 	Возврат ОбъектМаршрут.Ссылка;

КонецФункции

Функция ЗаполнитьМаршрутИВернутьПоручение(Знач СуществующийМаршрут, ДЛ_ЗаявкаНаДоставку) Экспорт
	
	ДанныеЗаполнения = Новый Структура("ДЛ_ЗаявкаНаДоставку", ДЛ_ЗаявкаНаДоставку);
	
	ОбъектМаршрут = СуществующийМаршрут.ПолучитьОбъект();
	ОбъектМаршрут.Заполнить(ДанныеЗаполнения);
	ОбъектМаршрут.Записать();
	ПЭ = ОбъектМаршрут.Титул1;
	
	Возврат ПЭ;
	
КонецФункции

Функция ВведенныеМаршрутыПорученияЭкспедитору(ДЛ_ЗаявкаНаДоставку) Экспорт
	
	ДокументыОснования = ДЛ_ЗаявкаНаДоставку.ДокументыОснования.Выгрузить(,"Документ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления
	|	И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ДокументОснование В(&ДокументыОснования)";
	
	Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования);
	
	Результат = Запрос.Выполнить();
	МассивМаршрутов = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивМаршрутов;
	
КонецФункции

Функция ПараметрыЗаполненияКонтурЛогистика(ДЛ_ЗаявкаНаДоставку) Экспорт
	
	//ДокументОснование = 
	ПараметрыФормы = Новый Структура;
	Возврат ПараметрыФормы;

КонецФункции

Функция СоздатьПЭПоМассивуМаршрутов(СуществующиеМаршруты) Экспорт
	
	НовоеПЭ = Документы.КонтурЛогистика_ПЭ_Титул1.СоздатьДокумент();
	
	НовоеПЭ.Заполнить(Новый Структура("МассивПартий", СуществующиеМаршруты));
	Если Не ЗначениеЗаполнено(НовоеПЭ.Дата) Тогда 
		НовоеПЭ.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НовоеПЭ.Записать();
	
	Для Каждого Маршрут Из СуществующиеМаршруты Цикл
		МаршрутОбъект = Маршрут.ПолучитьОбъект();
		МаршрутОбъект.Титул1 = НовоеПЭ.Ссылка;
		МаршрутОбъект.ОбменДанными.Загрузка = Истина;
		МаршрутОбъект.Записать();
	КонецЦикла;
	
	Возврат НовоеПЭ.Ссылка;

КонецФункции

Функция СтруктураОтображенияСтатусаПорученияЭкспедиторуДеловыеЛинии(ДЛ_ЗаявкаНаДоставку) Экспорт
	
	// TODO разделить через документ основание и через поиск по номеру
	// сейчас здесь только по номеру
	Маршрут = НайтиСуществующийМаршрут(ДЛ_ЗаявкаНаДоставку);
	Если Не ЗначениеЗаполнено(Маршрут) Тогда 
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью, "Оформить ЭПД");
	КонецЕсли;
	
	ПоручениеЭкспедитору = Маршрут.Титул1;
	Если Не ЗначениеЗаполнено(ПоручениеЭкспедитору) Тогда 
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью, "Оформить ЭПД");
	КонецЕсли;
	
	СтатусПоручения = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ПоручениеЭкспедитору, Истина);
	Если СтатусПоручения.Код = "pe-wait-forwarder" Тогда 
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_ЧеловекГалстук, "Ожидание подписи ДЛ");
	ИначеЕсли СтатусПоручения.Код = "pe-completed" Тогда
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_Рукопожатие, "ЭПД подписан");
	Иначе
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью, "Подписать ЭПД");
	КонецЕсли;
	
КонецФункции

Функция ДЛ_ЗаказыПоОснованиям(МассивОснований) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_ЗаявкаНаДоставкуДокументыОснования.Ссылка.НомерЗаказа КАК НомерЗаказа,
	|	ДЛ_ЗаявкаНаДоставкуДокументыОснования.Ссылка КАК ДЛ_ЗаявкаНаДоставку,
	|	ДЛ_ЗаявкаНаДоставкуДокументыОснования.Документ.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ДЛ_ЗаявкаНаДоставку.ДокументыОснования КАК ДЛ_ЗаявкаНаДоставкуДокументыОснования
	|ГДЕ
	|	ДЛ_ЗаявкаНаДоставкуДокументыОснования.Документ В(&СписокДокументовОснований)";
	
	Запрос.УстановитьПараметр("СписокДокументовОснований", МассивОснований);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗаказов = Результат.Выгрузить();
	
	Возврат ТаблицаЗаказов;
	
КонецФункции

Функция ДЛ_ОрганизацияЭкспедитор() Экспорт
	
	НайденнаяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиОрганизациюПоКлючевымРеквизитам("7826156685", "781001001");
	Если ЗначениеЗаполнено(НайденнаяОрганизация) Тогда 
		Возврат НайденнаяОрганизация;
	Иначе
		
		НоваяОрганизацияДД = Справочники.КонтурЛогистика_ОрганизацииДиадок.СоздатьЭлемент();
		НоваяОрганизацияДД.ИНН = "7826156685";
		НоваяОрганизацияДД.КПП = "781001001";
		НоваяОрганизацияДД.Наименование = "ООО""Деловые Линии""";
		НоваяОрганизацияДД.НаименованиеОрганизацииПолное = НоваяОрганизацияДД.Наименование;
		
		НоваяОрганизацияДД.ТелефонОсновной = "8-800-100-80-00";
		НоваяОрганизацияДД.АдресСтрока = "196210, город Санкт-Петербург, Стартовая ул., д. 8 литер а, офис 132";
		
		НоваяОрганизацияДД.Записать();
		МассивОрганизаций = Новый Массив;
		МассивОрганизаций.Добавить(НоваяОрганизацияДД.Ссылка);
		Справочники.КонтурЛогистика_ОрганизацииДиадок.АктуализироватьИзДиадока(МассивОрганизаций);
		НоваяОрганизацияДД.СинхронизироватьИзСервисаЛогистика();
		
		Возврат НоваяОрганизацияДД.Ссылка;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
